# Housing Market
### Introduction:
This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import random as ra

# Step 2. Create 3 differents Series, each of length 100, as follows:
1.The first a random number from 1 to 4
2.The second a random number from 1 to 3
3.The third a random number from 10,000 to 30,000

In [2]:
first = pd.Series(ra.randint(1,4) for i in range(100))
second = pd.Series(ra.randint(1,3) for i in range(100))
third = pd.Series(ra.randint(10000,40000) for i in range(100)) 
third

0     27275
1     33114
2     15187
3     14610
4     21844
      ...
95    15118
96    27990
97    25021
98    19384
99    19588
Length: 100, dtype: int64

Step 3. Let's create a DataFrame by joinning the Series by column

In [3]:
df = pd.concat([first,second,third],axis=1)#column=["First","Second","Third"])
df

    0  1      2
0   1  1  27275
1   4  1  33114
2   2  3  15187
3   4  3  14610
4   2  1  21844
.. .. ..    ...
95  3  3  15118
96  2  1  27990
97  3  3  25021
98  4  1  19384
99  3  3  19588

[100 rows x 3 columns]

Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [4]:
df.rename(columns={0:"bedrs",1:"bathrs",2:"price_sqr_meter"},inplace=True)
df

    bedrs  bathrs  price_sqr_meter
0       1       1            27275
1       4       1            33114
2       2       3            15187
3       4       3            14610
4       2       1            21844
..    ...     ...              ...
95      3       3            15118
96      2       1            27990
97      3       3            25021
98      4       1            19384
99      3       3            19588

[100 rows x 3 columns]

Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [5]:
df = df.apply(lambda x: x.astype(str))
df["bigcolumn"] = df["bedrs"] + ", " + df["bathrs"] + ", " + df["price_sqr_meter"]
df

   bedrs bathrs price_sqr_meter    bigcolumn
0      1      1           27275  1, 1, 27275
1      4      1           33114  4, 1, 33114
2      2      3           15187  2, 3, 15187
3      4      3           14610  4, 3, 14610
4      2      1           21844  2, 1, 21844
..   ...    ...             ...          ...
95     3      3           15118  3, 3, 15118
96     2      1           27990  2, 1, 27990
97     3      3           25021  3, 3, 25021
98     4      1           19384  4, 1, 19384
99     3      3           19588  3, 3, 19588

[100 rows x 4 columns]

Step 6. Oops, it seems it is going only until index 99. Is it true?

In [6]:
# yes because the index starts from 0

Step 7. Reindex the DataFrame so it goes from 0 to 299

In [7]:
ind = [i for i in range(300)]
df =pd.concat([first,second,third],axis=0,ignore_index=True)
df

0          1
1          4
2          2
3          4
4          2
       ...
295    15118
296    27990
297    25021
298    19384
299    19588
Length: 300, dtype: int64